class Figure:
    def __init__(self, type, length) -> None:
        assert length > 0, "Довжина має бути більшою за 0!"
        assert type in ["квадрат", "прямокутник", "трикутник"], "Дозволені фігури: квадрат, прямокутник, трикутник"
        self.type = type
        self.length = length

# Некоректні об'єкти (викликають помилки):
#a = Figure("трапеція", 12)    # помилка: фігура не дозволена
#b = Figure("квадрат", 0)      # помилка: довжина не > 0

# Коректний об'єкт:
c = Figure("квадрат", 1)
print(f"Тип фігури: {c.type}, довжина: {c.length}")
